{
    "$schema": "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "EnvironmentCode": {
            "AllowedValues": [
                "dev",
                "qa",
                "stg",
                "prod"
            ],
            "maxLength": 4,
            "type": "string",
            "metadata": {
                "description": "The base name of the solution. Up to 7 characters."
            }
        },
        "AppName": {
            "maxLength": 7,
            "type": "string",
            "metadata": {
                "description": "The base name of the solution. Up to 7 characters."
            }
        },
        "location": {
            "type": "string",
            "defaultValue": "East US"
        },
        "sku": {
            "type": "String",
            "allowedValues": [
                "Free",
                "Standalone",
                "PerNode",
                "PerGB2018"
            ],
            "metadata": {
                "description": "Service Tier: Free, Standalone, PerNode, or PerGB2018"
            }
        },
        "uniqueString": {
            "type": "string",
            "minLength": 13,
            "maxLength": 13,
            "defaultValue": "[uniqueString(resourceGroup().id, resourceGroup().location)]"
        }
    },
    "variables": {
        "baseNamePattern": "[toLower( concat(parameters('appName'), '-', parameters('EnvironmentCode'), '-{role}-', parameters('uniqueString')) )]",
        "baseStorageNamePattern": "[replace( variables('baseNamePattern'), '-', '0' )]",
        "workspaceName": "[replace(variables('baseNamePattern'),'{role}', 'oms-all')]",
        "logAnalyticsName": "[concat('AzureActivity', '(', variables('workspaceName'), ')' )]"
    },
    "resources": [
        {
            "type": "Microsoft.OperationalInsights/workspaces",
            "name": "[variables('workspaceName')]",
            "apiVersion": "2017-03-15-preview",
            "location": "[parameters('location')]",
            "properties": {
                "sku": {
                    "name": "[parameters('sku')]"
                },
                "features": {
                    "searchVersion": 1,
                    "legacy": 0
                }
            },
            "resources": [
                {
                    "type": "savedSearches",
                    "name": "NSG Queries",
                    "apiVersion": "2017-03-15-preview",
                    "dependsOn": [
                        "[resourceId('Microsoft.OperationalInsights/workspaces', variables('workspaceName'))]"
                    ],
                    "properties": {
                        "Category": "MyQueries",
                        "ETag": "*",
                        "DisplayName": "NSG Modifications",
                        "Query": "AzureActivity | where ResourceId matches regex \"Microsoft.Network/networkSecurityGroups\"",
                        "Version": 1
                    }
                }
            ]
        },
        {
            "type": "Microsoft.OperationsManagement/solutions",
            "name": "[variables('logAnalyticsName')]",
            "apiVersion": "2015-11-01-preview",
            "location": "[parameters('location')]",
            "plan": {
                "name": "[variables('logAnalyticsName')]",
                "promotionCode": "",
                "publisher": "Microsoft",
                "product": "OMSGallery/AzureActivity"
            },
            "properties": {
                "workspaceResourceId": "[resourceId('Microsoft.OperationalInsights/workspaces', variables('workspaceName'))]",
                "containedResources": [
                    "[resourceId('Microsoft.OperationalInsights/workspaces/views', variables('workspaceName'), variables('logAnalyticsName'))]"
                ]
            },
            "dependsOn": [
                "[resourceId('Microsoft.OperationalInsights/workspaces', variables('workspaceName'))]"
            ]
        }
    ]
}